#### ExternalResourceType Members

---

|  |
| --- |
| ExternalResourceType Class   Constructors   Methods   Operators   Properties   See Also |

The  ExternalResourceType  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExternalResourceType | Creates a new ExternalResourceType instance. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Compares two Guid-based enum object based on their concrete class and GUID value. (Inherited from  GuidEnum  .) |
| Public method | GetHashCode | Generates a hash code for this Guid-based enum object. (Inherited from  GuidEnum  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Operators

|  | Name | Description |
| --- | --- | --- |
| Public operator Static member | Equality | Compares two ExternalResourceType instances. |
| Public operator Static member | Inequality | Compares two ExternalResourceType instances. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Guid | The Guid of GUID-based enum object. (Inherited from  GuidEnum  .) |

# See Also

ExternalResourceType Class

Autodesk.Revit.DB Namespace